In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = {"state":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2000, 2002, 2003],
       "pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2000, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [4]:
frame=pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2002  2.9

In [7]:
pd.DataFrame(data, columns=["pop", "state", "year"])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2000
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [8]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [9]:
frame["pop"]

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [10]:
frame.pop

<bound method DataFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [11]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [12]:
frame2=pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [13]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2000  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [14]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [15]:
frame2["debt"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [17]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [18]:
frame2.loc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [19]:
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [21]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2000  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [25]:
frame2["eastern"]=frame2["state"]=="Ohio"

In [26]:
frame2

   year   state  pop debt  eastern
0  2000    Ohio  1.5  NaN     True
1  2001    Ohio  1.7  NaN     True
2  2002    Ohio  3.6  NaN     True
3  2000  Nevada  2.4  NaN    False
4  2002  Nevada  2.9  NaN    False
5  2003  Nevada  3.2  NaN    False

In [27]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [29]:
del frame2["eastern"]

In [30]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [31]:
In [72]: populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
....:
"Nevada": {2001: 2.4, 2002: 2.9}}

In [32]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [33]:
frame3=pd.DataFrame(populations)

In [34]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [35]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [37]:
pd.DataFrame(populations, index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [40]:
frame3.index.name

'year'

In [39]:
frame3.index.name="year"

In [41]:
frame3

      Ohio  Nevada
year
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [42]:
frame3.columns.name="state"

In [43]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [46]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [47]:
frame2.to_csv

<bound method NDFrame.to_csv of    year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2000  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN>

In [48]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2000, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [50]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [51]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [54]:
"Ohio" in frame3.columns

True

In [55]:
2003 in frame3.index

False

In [56]:
2001 in frame3.index

True

In [57]:
obj=pd.Series(np.arange(5), index=list('howdy'))

In [58]:
obj

h    0
o    1
w    2
d    3
y    4
dtype: int64

In [60]:
obj2=obj.reindex(list('buddy'))
obj2

b    NaN
u    NaN
d    3.0
d    3.0
y    4.0
dtype: float64

In [61]:
obj

h    0
o    1
w    2
d    3
y    4
dtype: int64

In [67]:
#obj.reindex(np.arange(7), method="ffill")
obj.reindex(np.arange(5))

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64

In [75]:
obj3=pd.Series([x*x for x in np.arange(6) if x > 0], index=list("12345"))
obj3

1     1
2     4
3     9
4    16
5    25
dtype: int64

In [98]:
obj4=pd.Series(list('sukhoi'), index=[int(x) for x in list('012456')])
obj4
obj4.index

Index([0, 1, 2, 4, 5, 6], dtype='int64')

In [96]:
[print(type(int(x))) for x in list('123')]

<class 'int'>
<class 'int'>
<class 'int'>

[None, None, None]

In [99]:
np.arange(8)
obj4.reindex(np.arange(8), method="ffill")

0    s
1    u
2    k
3    k
4    h
5    o
6    i
7    i
dtype: object

In [87]:
obj5 = pd.Series(["blue", "purple", "yellow"], index=[0, 1, 2])

In [88]:
obj5

0      blue
1    purple
2    yellow
dtype: object

In [89]:
obj5.reindex(np.arange(6), method='ffill')

0      blue
1    purple
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [100]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)), 
                   index=['a', 'c', 'd'],
                   columns=['Ohio', "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [101]:
frame2=frame.reindex(index=['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [105]:
frame2["Ohio"]

a    0.0
b    NaN
c    3.0
d    6.0
Name: Ohio, dtype: float64

In [108]:
frame2.loc['b']=2.6
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.6    2.6         2.6
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [109]:
frame3=frame2.reindex(index=['a', 'b','c', 'd', 'e'])
frame3

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.6    2.6         2.6
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [114]:
frame3["Ohio"].fillna(frame3["Ohio"].mean())

a    0.0
b    2.6
c    3.0
d    6.0
e    2.9
Name: Ohio, dtype: float64

In [120]:
for x in frame3.columns:
    frame3[x].fillna(frame3[x].mean(), inplace=True)
    #print(frame3[x].mean())
    #print(frame3)
frame3

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.6    2.6         2.6
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   2.9    NaN         NaN
   Ohio  Texas  California
a   0.0   1.00         2.0
b   2.6   2.60         2.6
c   3.0   4.00         5.0
d   6.0   7.00         8.0
e   2.9   3.65         NaN
   Ohio  Texas  California
a   0.0   1.00         2.0
b   2.6   2.60         2.6
c   3.0   4.00         5.0
d   6.0   7.00         8.0
e   2.9   3.65         4.4

   Ohio  Texas  California
a   0.0   1.00         2.0
b   2.6   2.60         2.6
c   3.0   4.00         5.0
d   6.0   7.00         8.0
e   2.9   3.65         4.4

In [121]:
In [118]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
.....:
index=["Ohio", "Colorado", "Utah", "New York"],
.....:
columns=["one", "two", "three", "four"])
In [119]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
data.T

       Ohio  Colorado  Utah  New York
one       0         4     8        12
two       1         5     9        13
three     2         6    10        14
four      3         7    11        15

In [123]:
data.drop(index=["Colorado", "Utah"])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [125]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [127]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [128]:
data.drop('Utah', axis=0)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [129]:
data.drop('Utah', axis=0).drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
New York   12     14    15

In [136]:
obj=pd.Series([np.sqrt(x) for x in np.arange(4.)], index=['a', 'b', 'c', 'd'])
obj

a    0.000000
b    1.000000
c    1.414214
d    1.732051
dtype: float64

In [137]:
obj['b']

1.0

In [138]:
obj[1:3]

b    1.000000
c    1.414214
dtype: float64

In [142]:
obj[-3:-1]

b    1.000000
c    1.414214
dtype: float64

In [144]:
obj[::-1]

d    1.732051
c    1.414214
b    1.000000
a    0.000000
dtype: float64

In [146]:
obj[obj<1.5]

a    0.000000
b    1.000000
c    1.414214
dtype: float64

In [147]:
In [144]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
.....:
index=["Ohio", "Colorado", "Utah", "New York"],
.....:
columns=["one", "two", "three", "four"])
In [145]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [148]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [149]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [150]:
data[data['two']<10]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [151]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [152]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [153]:
data[data%2==0]

          one  two  three  four
Ohio        0  NaN      2   NaN
Colorado    4  NaN      6   NaN
Utah        8  NaN     10   NaN
New York   12  NaN     14   NaN

In [156]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [157]:
data.loc["Utah"]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [160]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [161]:
data.loc["Utah", ['two', 'four']]

two      9
four    11
Name: Utah, dtype: int64

In [165]:
#same result using iloc
data.iloc[2, [1,3]]

two      9
four    11
Name: Utah, dtype: int64

In [166]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [168]:
data.iloc[:,:2][data['three']>6]

          one  two
Utah        8    9
New York   12   13

In [169]:
data.iloc[:, :2][data.three>6]

          one  two
Utah        8    9
New York   12   13

In [170]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [172]:
data.loc[data.four>10]=-4
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah       -4   -4     -4    -4
New York   -4   -4     -4    -4

In [180]:
data.loc[data.three==-4, "three"]=6.3
data

          one  two  three  four
Ohio        0    0    0.0     0
Colorado    0    5    6.0     7
Utah       -4   -4    6.3    -4
New York   -4   -4    6.3    -4

In [185]:
data[data<0]=4.1
data

          one  two  three  four
Ohio      0.0  0.0    0.0   0.0
Colorado  0.0  5.0    6.0   7.0
Utah      4.1  4.1    6.3   4.1
New York  4.1  4.1    6.3   4.1

In [186]:
In [187]: df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
.....:
index=["Ohio", "Texas", "Colorado"])
In [188]: df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
.....:
index=["Utah", "Ohio", "Texas", "Oregon"])

In [187]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [188]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [189]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [190]:
In [197]: df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
.....:
columns=list("abcd"))
In [198]: df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
.....:
columns=list("abcde"))

In [191]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [192]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [193]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [195]:
df2.loc[1, 'b']=np.nan

In [196]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [197]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [198]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [199]:
In [223]: frame = pd.DataFrame(np.random.standard_normal((4, 3)),
.....:
columns=list("bde"),
.....:
index=["Utah", "Ohio", "Texas", "Oregon"])

In [200]:
frame

               b         d         e
Utah    0.359937 -1.921392 -0.692845
Ohio   -0.663672 -0.382914  0.818959
Texas   0.990253 -0.169726  0.012710
Oregon  0.546427 -1.648288  2.423506

In [201]:
np.abs(frame)

               b         d         e
Utah    0.359937  1.921392  0.692845
Ohio    0.663672  0.382914  0.818959
Texas   0.990253  0.169726  0.012710
Oregon  0.546427  1.648288  2.423506

In [203]:
In [226]: def f1(x):
.....:
            return x.max() - x.min()

In [204]:
frame.apply(f1)

b    1.653925
d    1.751666
e    3.116351
dtype: float64

In [205]:
frame

               b         d         e
Utah    0.359937 -1.921392 -0.692845
Ohio   -0.663672 -0.382914  0.818959
Texas   0.990253 -0.169726  0.012710
Oregon  0.546427 -1.648288  2.423506

In [206]:
frame.apply(f1, axis="columns")

Utah      2.281329
Ohio      1.482631
Texas     1.159979
Oregon    4.071794
dtype: float64

In [207]:
In [229]: def f2(x):
.....:
            return pd.Series([x.min(), x.max()], index=["min", "max"])

In [209]:
frame.apply(f2, axis="columns")

             min       max
Utah   -1.921392  0.359937
Ohio   -0.663672  0.818959
Texas  -0.169726  0.990253
Oregon -1.648288  2.423506

In [210]:
def ff(x):
    return x*x

In [211]:
frame.apply(ff, axis='columns')

               b         d         e
Utah    0.129554  3.691748  0.480035
Ohio    0.440460  0.146623  0.670694
Texas   0.980601  0.028807  0.000162
Oregon  0.298583  2.716853  5.873380

In [212]:
obj

a    0.000000
b    1.000000
c    1.414214
d    1.732051
dtype: float64

In [213]:
obj.rank()

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [214]:
In [267]: df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
.....:
[np.nan, np.nan], [0.75, -1.3]],
.....:
index=["a", "b", "c", "d"],
.....:
columns=["one", "two"])
In [268]: df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [215]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [216]:
df.T.sum()

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [217]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [218]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [219]:
df.T.mean()

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [220]:
df.idmax()

AttributeError: 'DataFrame' object has no attribute 'idmax'

In [221]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [222]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [223]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [225]:
#price=pd.read_pickle("https://raw.githubusercontent.com/BrambleXu/pydata-notebook/blob/master/examples/yahoo_price.pkl")

In [226]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [227]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [228]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [229]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [232]:
obj[obj.isin(["b","c"])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [234]:
obj.value_counts()>2

c     True
a     True
b    False
d    False
Name: count, dtype: bool

In [235]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [236]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [238]:
pd.Index(obj.unique()).get_indexer(obj)

array([0, 1, 2, 1, 1, 3, 3, 0, 0])

In [239]:
!pwd

/media/tom/StorageONE/my-github

In [240]:
!cat ./data/csv_minindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [241]:
parsed=pd.read_csv('data/csv_minindex.csv', index_col=["key1", "key2"])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [242]:
parsed.reindex(columns=['key2'])

           key2
key1 key2
one  a      NaN
     b      NaN
     c      NaN
     d      NaN
two  a      NaN
     b      NaN
     c      NaN
     d      NaN

In [243]:
result=pd.read_csv('data/ext3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [246]:
!cat data/ext4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [244]:
pd.read_csv('data/ext4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [245]:
pd.read_csv('data/ext4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [247]:
!cat data/ext5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [249]:
result=pd.read_csv('data/ext5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [250]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [253]:
In [35]: result3 = pd.read_csv("data/ext5.csv", keep_default_na=False,
....:
        na_values=["NA"])

In [254]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [255]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [256]:
pd.options.display.max_rows = 10

In [257]:
result = pd.read_csv("data/ext6.csv")
result

                       one two three four key
0   0 .467976 -0.038649 -0.295344 -1.824726 L
1   1 -0.358893 1.404453 0.704965 -0.200638 B
2  2 -0.501840 0.659254 -0.421691 -0.057688 G

In [258]:
data=pd.read_csv('data/ext5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [259]:
data.to_csv('data/ext5-copy.csv')
!cat data/ext5-copy.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [260]:
!cat data/ext5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [261]:
import sys

In [262]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [263]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [264]:
import csv

In [265]:
f=open('data/ex7.csv')

In [266]:
reader=csv.reader(f)

In [267]:
for x in reader:
    print(x)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [268]:
with open('data/ex7.csv') as f:
    lines=list(csv.reader(f))
    header, values=lines[0], lines[1:]
    data_dict={h:v for h, v in zip(header, zip(*values))}

In [269]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [270]:
obj = """
{"name": "Wes",
"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
{"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [271]:
obj

'\n{"name": "Wes",\n"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],\n"pet": null,\n"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},\n{"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]\n}\n'

In [272]:
import json

In [273]:
result=json.loads(obj)
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [274]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])
siblings

    name  age
0  Scott   34
1  Katie   42

In [275]:
data=pd.read_json('data/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [276]:
!cat data/example.json

[{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}]

In [277]:
import requests

In [278]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [279]:
resp=requests.get(url)
resp

In [280]:
data=resp.json()

In [281]:
data[0]["title"]

'BUG: pandas.DataFrame.to_parquet() causing memory leak'

In [282]:
data[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296/events',
 'html_url': 'https://github.com/pandas-dev/pandas/issues/55296',
 'id': 1913217005,
 'node_id': 'I_kwDOAA0YD85yCV_t',
 'number': 55296,
 'title': 'BUG: pandas.DataFrame.to_parquet() causing memory leak',
 'user': {'login': 'RizzoV',
  'id': 12030659,
  'node_id': 'MDQ6VXNlcjEyMDMwNjU5',
  'avatar_url': 'https://avatars.githubusercontent.com/u/12030659?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/RizzoV',
  'html_url': 'https://github.com/RizzoV',
  'followers_url': 'https://api.github.com/users/RizzoV/followers',
  'following_url': 'https://api.github.com/users/RizzoV/following{/other_user}',
  'gists_url': 'https://api.github.com/users/RizzoV/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/RizzoV/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/RizzoV/subscriptions',
  'organizations_url': 'https://api.github.com/users/RizzoV/orgs',
  'repos_url': 'https://api.github.com/users/RizzoV/repos',
  'events_url': 'https://api.github.com/users/RizzoV/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/RizzoV/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 76811,
   'node_id': 'MDU6TGFiZWw3NjgxMQ==',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Bug',
   'name': 'Bug',
   'color': 'e10c02',
   'default': False,
   'description': None},
  {'id': 1954720290,
   'node_id': 'MDU6TGFiZWwxOTU0NzIwMjkw',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Needs%20Triage',
   'name': 'Needs Triage',
   'color': '0052cc',
   'default': False,
   'description': 'Issue that has not been reviewed by a pandas team member'}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 0,
 'created_at': '2023-09-26T10:38:12Z',
 'updated_at': '2023-09-26T10:40:35Z',
 'closed_at': None,
 'author_association': 'NONE',
 'active_lock_reason': None,
 'body': '### Pandas version checks\r\n\r\n- [X] I have checked that this issue has not already been reported.\r\n\r\n- [X] I have confirmed this bug exists on the [latest version](https://pandas.pydata.org/docs/whatsnew/index.html) of pandas.\r\n\r\n- [ ] I have confirmed this bug exists on the [main branch](https://pandas.pydata.org/docs/dev/getting_started/install.html#installing-the-development-version-of-pandas) of pandas.\r\n\r\n\r\n### Reproducible Example\r\n\r\n```python\r\nimport os\r\nimport string\r\nimport sys\r\nfrom random import choice, randint\r\nfrom uuid import uuid4\r\n\r\nimport pandas as pd\r\nimport pyarrow as pa\r\nfrom memory_profiler import profile\r\n\r\nsample_schema = pa.struct(\r\n    [\r\n        ("a", pa.string()),\r\n        (\r\n            "b",\r\n            pa.struct(\r\n                [\r\n                    ("ba", pa.list_(pa.string())),\r\n                    ("bc", pa.string()),\r\n                    ("bd", pa.string()),\r\n                    ("be", pa.list_(pa.string())),\r\n                    (\r\n                        "bf",\r\n                        pa.list_(\r\n                            pa.struct(\r\n                                [\r\n                                    (\r\n                                        "bfa",\r\n                                        pa.struct(\r\n                                            [\r\n                                                ("bfaa", pa.string()),\r\n                                                ("bfab", pa.string()),\r\n                                                ("bfac", pa.string()),\r\n                                                ("bfad", pa.float64()),\r\n                                                ("bfae", pa.string()),\r\n                                            ]\r\n                                        ),\r\n                                    )\r\n                                ]\r\n                            )\r\n                        ),\r\n                    ),\r\n                ]\r\n            ),\r\n        ),\r\n        ("c", pa.int64()),\r\n        ("d", pa.int64()),\r\n        ("e", pa.string()),\r\n        (\r\n            "f",\r\n            pa.struct(\r\n                [\r\n                    ("fa", pa.string()),\r\n                    ("fb", pa.string()),\r\n                    ("fc", pa.string()),\r\n                    ("fd", pa.string()),\r\n                    ("fe", pa.string()),\r\n                    ("ff", pa.string()),\r\n                    ("fg", pa.string()),\r\n                ]\r\n            ),\r\n        ),\r\n        ("g", pa.int64()),\r\n    ]\r\n)\r\n\r\n\r\ndef generate_random_string(str_length: int) -> str:\r\n    return "".join(\r\n        [choice(string.ascii_lowercase + string.digits) for n in range(str_length)]\r\n    )\r\n\r\n\r\n@profile\r\ndef write_to_parquet(df, output_dir):\r\n    output_path = os.path.join(output_dir, f"{uuid4()}.parquet")\r\n    df.to_parquet(output_path, schema=pa.schema(sample_schema))\r\n    return output_path\r\n\r\n\r\n@profile\r\ndef write_to_json(df, output_dir):\r\n    output_path = os.path.join(output_dir, f"{uuid4()}.json")\r\n    df.to_json(output_path)\r\n    return output_path\r\n\r\n\r\ndef main():\r\n    output_dir = os.path.abspath(\r\n        sys.argv[1]\r\n    )  # destination for temporary files when outputting Parquets/JSONs\r\n\r\n    if not os.path.isdir(output_dir):\r\n        print("Creating output dir", output_dir)\r\n        os.makedirs(output_dir)\r\n\r\n    for i in range(10000):\r\n        df = pd.DataFrame.from_dict(generate_random_data())\r\n        # pa.jemalloc_set_decay_ms(0)\r\n        output_path = write_to_parquet(df, output_dir)  # memory leak\r\n        # output_path = write_to_json(df, output_dir)  # stable memory usage\r\n        if output_path is not None:\r\n            os.remove(output_path)\r\n\r\n\r\ndef generate_random_data():\r\n    return {\r\n        "a": [generate_random_string(128)],\r\n        "b": [\r\n            {\r\n                "ba": [generate_random_string(128) for i in range(50)],\r\n                "bc": generate_random_string(128),\r\n                "bd": generate_random_string(128),\r\n                "be": [generate_random_string(128) for i in range(50)],\r\n                "bf": [\r\n                    {\r\n                        "bfa": {\r\n                            "bfaa": generate_random_string(128),\r\n                            "bfab": generate_random_string(128),\r\n                            "bfac": generate_random_string(128),\r\n                            "bfad": randint(0, 2**32),\r\n                            "bfae": generate_random_string(128),\r\n                        }\r\n                    }\r\n                ],\r\n            }\r\n        ],\r\n        "c": [randint(0, 2**32)],\r\n        "d": [randint(0, 2**32)],\r\n        "e": [generate_random_string(128)],\r\n        "f": [\r\n            {\r\n                "fa": generate_random_string(128),\r\n                "fb": generate_random_string(128),\r\n                "fc": generate_random_string(128),\r\n                "fd": generate_random_string(128),\r\n                "fe": generate_random_string(128),\r\n                "ff": generate_random_string(128),\r\n                "fg": generate_random_string(128),\r\n            }\r\n        ],\r\n        "g": [randint(0, 2**32)],\r\n    }\r\n\r\n\r\nif __name__ == "__main__":\r\n    main()\r\n```\r\n\r\n\r\n### Issue Description\r\n\r\n`pandas.DataFrame.to_parquet()` causes a memory leak when `engine=\'pyarrow\'` (default option). \r\n\r\nUsing another engine (e.g.: `engine=\'fastparquet\'`) or outputting the same data in another format (e.g.: `pandas.DataFrame.to_json()`, see `write_to_json()` in the Reproducible Example) avoids the memory leak.\r\n\r\nThe problem seems to be more pronounced on DataFrames containing nested structs. A sample problematic data schema and a compliant data generator is included in the Reproducible Example.\r\n\r\n### Expected Behavior\r\n\r\nNo memory leaks.\r\n\r\n### Installed Versions\r\n\r\n<details>\r\nINSTALLED VERSIONS\r\n------------------\r\ncommit              : e86ed377639948c64c429059127bcf5b359ab6be\r\npython              : 3.10.9.final.0\r\npython-bits         : 64\r\nOS                  : Darwin\r\nOS-release          : 22.6.0\r\nVersion             : Darwin Kernel Version 22.6.0: Fri Sep 15 13:39:52 PDT 2023; root:xnu-8796.141.3.700.8~1/RELEASE_X86_64\r\nmachine             : x86_64\r\nprocessor           : i386\r\nbyteorder           : little\r\nLC_ALL              : None\r\nLANG                : it_IT.UTF-8\r\nLOCALE              : it_IT.UTF-8\r\n\r\npandas              : 2.1.1\r\nnumpy               : 1.26.0\r\npytz                : 2021.3\r\ndateutil            : 2.8.2\r\nsetuptools          : 65.6.3\r\npip                 : 23.2.1\r\nCython              : None\r\npytest              : None\r\nhypothesis          : None\r\nsphinx              : None\r\nblosc               : None\r\nfeather             : None\r\nxlsxwriter          : None\r\nlxml.etree          : 4.9.1\r\nhtml5lib            : None\r\npymysql             : None\r\npsycopg2            : None\r\njinja2              : 3.1.2\r\nIPython             : 8.11.0\r\npandas_datareader   : None\r\nbs4                 : 4.11.1\r\nbottleneck          : None\r\ndataframe-api-compat: None\r\nfastparquet         : 0.8.3\r\nfsspec              : 2022.10.0\r\ngcsfs               : None\r\nmatplotlib          : 3.7.0\r\nnumba               : None\r\nnumexpr             : None\r\nodfpy               : None\r\nopenpyxl            : 3.1.2\r\npandas_gbq          : None\r\npyarrow             : 13.0.0\r\npyreadstat          : None\r\npyxlsb              : None\r\ns3fs                : 2022.10.0\r\nscipy               : 1.10.1\r\nsqlalchemy          : None\r\ntables              : None\r\ntabulate            : None\r\nxarray              : None\r\nxlrd                : None\r\nzstandard           : None\r\ntzdata              : 2023.3\r\nqtpy                : None\r\npyqt5               : None\r\n\r\n</details>\r\n',
 'reactions': {'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296/reactions',
  'total_count': 0,
  '+1': 0,
  '-1': 0,
  'laugh': 0,
  'hooray': 0,
  'confused': 0,
  'heart': 0,
  'rocket': 0,
  'eyes': 0},
 'timeline_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/55296/timeline',
 'performed_via_github_app': None,
 'state_reason': None}

In [283]:
for i in range(10):
    print(data[i]["title"])

BUG: pandas.DataFrame.to_parquet() causing memory leak
BUG: compatibility between pd.Timestamp() and datetime.date()
BUG: `date_range` `inclusive` parameter behavior doesn't match interval notation when `start == end`
ENH: Improve Filter function with Filter_Columns and Filter_Rows
QST: get the last one value in a dataframe's certain column
BUG: sqlalchemy.exc.InvalidRequestError: Could not reflect: requested table(s)
BUG: resample('MS') may introduce trailing empty windows
BUG: df.resample('MS', closed='right') incorrectly places bins
BUG: resample('B') ignores `closed` and `label`?
BUG: bin edges incorrect in resample for 'B' and 'C'

In [286]:
import sqlite3

In [287]:
In [136]: query = """
.....: CREATE TABLE test
.....: (a VARCHAR(20), b VARCHAR(20),
.....: c REAL,d INTEGER
.....: );"""

In [289]:
con=sqlite3.connect('mydata.sqlite')

In [290]:
con.execute(query)

In [291]:
con.commit()

In [292]:
In [140]: data = [("Atlanta", "Georgia", 1.25, 6),
.....:
("Tallahassee", "Florida", 2.6, 3),
.....:
("Sacramento", "California", 1.7, 5)]
In [141]: stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
In [142]: con.executemany(stmt, data)

In [293]:
con.commit()

In [294]:
In [144]: cursor = con.execute("SELECT * FROM test")
In [145]: rows = cursor.fetchall()

In [295]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [297]:
!pwd

/media/tom/StorageONE/my-github

In [298]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [299]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [300]:
In [149]: import sqlalchemy as sqla
In [150]: db = sqla.create_engine("sqlite:///mydata.sqlite")
In [151]: pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [301]:
In [26]: data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
....:
[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [302]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [303]:
data.isna()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True
3   True  False  False

In [304]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [305]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [307]:
data.dropna(axis='columns', how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [311]:
In [33]: df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -0.574568  0.538722  0.070428
1  0.399676 -0.577340 -0.777813
2 -0.246695  0.132543 -1.301299
3 -1.471150 -1.564909 -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [312]:
df.iloc[:4,1]=np.nan
df

          0         1         2
0 -0.574568       NaN  0.070428
1  0.399676       NaN -0.777813
2 -0.246695       NaN -1.301299
3 -1.471150       NaN -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [313]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.574568       NaN       NaN
1  0.399676       NaN       NaN
2 -0.246695       NaN -1.301299
3 -1.471150       NaN -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [315]:
df.dropna(how='all')

          0         1         2
0 -0.574568       NaN       NaN
1  0.399676       NaN       NaN
2 -0.246695       NaN -1.301299
3 -1.471150       NaN -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [316]:
df.dropna(thresh=2)

          0         1         2
2 -0.246695       NaN -1.301299
3 -1.471150       NaN -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [317]:
df.fillna(0)

          0         1         2
0 -0.574568  0.000000  0.000000
1  0.399676  0.000000  0.000000
2 -0.246695  0.000000 -1.301299
3 -1.471150  0.000000 -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [318]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.574568  0.500000  0.000000
1  0.399676  0.500000  0.000000
2 -0.246695  0.500000 -1.301299
3 -1.471150  0.500000 -1.273871
4  0.250686 -0.262747 -1.333316
5  1.686937 -1.102659  0.904188
6  0.418460 -0.059815 -1.551418

In [319]:
df=pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858 -0.127775 -0.168288
3 -0.259807  0.263832  0.144798
4 -0.139396 -0.784412 -0.962136
5 -0.335021 -2.358455  1.215765

In [320]:
df.iloc[2:, 1]=np.nan
df

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858       NaN -0.168288
3 -0.259807       NaN  0.144798
4 -0.139396       NaN -0.962136
5 -0.335021       NaN  1.215765

In [321]:
df.iloc[4:, 2]=np.nan
df

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858       NaN -0.168288
3 -0.259807       NaN  0.144798
4 -0.139396       NaN       NaN
5 -0.335021       NaN       NaN

In [322]:
df.fillna(method="ffill")

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858  0.536193 -0.168288
3 -0.259807  0.536193  0.144798
4 -0.139396  0.536193  0.144798
5 -0.335021  0.536193  0.144798

In [328]:
df

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858       NaN -0.168288
3 -0.259807       NaN  0.144798
4 -0.139396       NaN       NaN
5 -0.335021       NaN       NaN

In [329]:
df.mean()

0    0.212125
1    0.136879
2    0.294522
dtype: float64

In [330]:
df.fillna(data.mean())

          0         1         2
0  0.299958 -0.262434  0.521519
1 -0.429844  0.536193  0.680058
2  2.136858  6.500000 -0.168288
3 -0.259807  6.500000  0.144798
4 -0.139396  6.500000  3.000000
5 -0.335021  6.500000  3.000000

In [332]:
df.loc[2].mean()

0.9842850913465595

In [337]:
df.loc[:,2].mean()

0.2945218092647289

In [338]:
In [49]: data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
....:
"k2": [1, 1, 2, 3, 3, 4, 4]})
In [50]: data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [339]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [340]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [341]:
data['v1']=range(7)

In [342]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [343]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [344]:
In [56]: data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [345]:
In [56]: data.drop_duplicates(["k1", "k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [346]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [347]:
In [57]: data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
....:
"pastrami", "corned beef", "bacon",
....:
"pastrami", "honey ham", "nova lox"],
....:
"ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [348]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [349]:
meat_to_animal = {
"bacon": "pig",
"pulled pork": "pig",
"pastrami": "cow",
"corned beef": "cow",
"honey ham": "pig",
"nova lox": "salmon"
}

In [350]:
data['animal']=data['food'].map(meat_to_animal)

In [351]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [352]:
In [70]: data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....:
index=["Ohio", "Colorado", "New York"],
....:
columns=["one", "two", "three", "four"])

In [355]:
In [71]: def transform(x):
....:
        return x[:4].upper()
In [72]: data.index.map(transform)
Out[72]: index(['OHIO', 'COLO', 'NEW '], dtype='object')

NameError: name 'index' is not defined